app/controllers/posts_controller.rb

  def index
    if params[:author_id] # if this is reached via a nested route example: /authors/1/posts
      @posts = Author.find(params[:author_id]).posts # @posts will be only the collection of posts pertaining to that author
    else
      @posts = Post.all # @posts will be ALL posts
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"

  def show # no change for nested resource needed here, /authors/:id/posts/:id and /posts/:id will render t he same information
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]